{
  "<PAD>": 0,
  "<UNK>": 1,
  "": 2,
  ".5": 3,
  ".0": 4,
  ".1": 5,
  ".2": 6,
  ".3": 7,
  ".7": 8,
  ".6": 9,
  ".8": 10,
  ".4": 11,
  ".00": 12,
  ".9": 13,
  ".000": 14,
  ".25": 15,
  ".01": 16,
  ".10": 17,
  ".05": 18,
  ".14": 19,
  ".75": 20,
  ".000000": 21,
  ".15": 22,
  ".001": 23,
  ".03": 24,
  ".02": 25,
  ".12": 26,
  ".20": 27,
  ".08": 28,
  ".50": 29,
  ".14159265358979323846": 30,
  ".141592653589793": 31,
  ".09": 32,
  ".00000000": 33,
  ".0001": 34,
  ".11": 35,
  ".04": 36,
  ".33": 37,
  ".13": 38,
  ".99": 39,
  ".06": 40,
  ".67": 41,
  ".00000": 42,
  ".0000000000000000000": 43,
  ".50000": 44,
  ".07": 45,
  ".16": 46,
  ".45": 47,
  ".000000000": 48,
  ".000001": 49,
  ".23": 50,
  ".34": 51,
  ".95": 52,
  ".231": 53,
  ".35": 54,
  ".1415926535897932384626": 55,
  ".30": 56,
  ".55": 57,
  ".00001": 58,
  ".32": 59,
  ".168": 60,
  ".21": 61,
  ".36": 62,
  ".85": 63,
  ".141592653589793238": 64,
  ".18": 65,
  ".141592653589793238462": 66,
  ".17": 67,
  ".375": 68,
  ".125": 69,
  ".1415926535897932384626433832795": 70,
  ".22": 71,
  ".28": 72,
  ".49": 73,
  ".999": 74,
  ".59": 75,
  ".63": 76,
  ".98": 77,
  ".54": 78,
  ".65": 79,
  ".14159": 80,
  ".56": 81,
  ".27": 82,
  ".40": 83,
  ".88": 84,
  ".000000001": 85,
  ".42": 86,
  ".78": 87,
  ".006": 88,
  ".76": 89,
  ".80": 90,
  ".29": 91,
  ".31": 92,
  ".19": 93,
  ".43": 94,
  ".90": 95,
  ".0000": 96,
  ".52": 97,
  ".000000011": 98,
  ".24": 99,
  ".44": 100,
  ".66": 101,
  ".93": 102,
  ".26": 103,
  ".46": 104,
  ".51": 105,
  ".14159265359": 106,
  ".305785": 107,
  ".39": 108,
  ".53": 109,
  ".57": 110,
  ".62": 111,
  ".97": 112,
  ".0000000000": 113,
  ".0000001": 114,
  ".005": 115,
  ".14159265": 116,
  ".64": 117,
  ".70": 118,
  ".71": 119,
  ".81": 120,
  ".37": 121,
  ".83": 122,
  ".4142135624": 123,
  ".89": 124,
  ".96": 125,
  ".1415926536": 126,
  ".47": 127,
  ".91": 128,
  ".94": 129,
  ".00000001": 130,
  ".123": 131,
  ".69": 132,
  ".77": 133,
  ".141592653589": 134,
  ".38": 135,
  ".61": 136,
  ".68": 137,
  ".60": 138,
  ".6667": 139,
  ".72": 140,
  ".74": 141,
  ".84": 142,
  ".000000000000001": 143,
  ".100": 144,
  ".87": 145,
  ".1415926535": 146,
  ".666667": 147,
  ".14159265358979": 148,
  ".82": 149,
  ".0000000": 150,
  ".255": 151,
  ".41": 152,
  ".73": 153,
  ".79": 154,
  ".92": 155,
  ".000000000000": 156,
  ".003": 157,
  ".54609188": 158,
  ".000000000001": 159,
  ".500": 160,
  ".609344": 161,
  ".86": 162,
  ".00000000000": 163,
  ".48": 164,
  ".6180339887498948482045868343656381177203": 165,
  ".6568542495": 166,
  ".012": 167,
  ".1415": 168,
  ".234": 169,
  ".58": 170,
  ".33333": 171,
  ".002": 172,
  ".020": 173,
  ".143": 174,
  ".50000000000000000000000": 175,
  ".549": 176,
  ".082": 177,
  ".400": 178,
  ".500000": 179,
  ".9999": 180,
  ".1415926": 181,
  ".333": 182,
  ".333333": 183,
  ".33333333": 184,
  ".414": 185,
  ".41421": 186,
  ".7500": 187,
  ".004": 188,
  ".024": 189,
  ".1416": 190,
  ".999999": 191,
  ".999999999": 192,
  ".007": 193,
  ".025": 194,
  ".14159265358979323846264338327950288419716939937510582097494459230": 195,
  ".245": 196,
  ".4142": 197,
  ".618": 198,
  ".625": 199,
  ".71828182845904523536": 200,
  ".875": 201,
  ".0005": 202,
  ".010": 203,
  ".250": 204,
  ".3333333333333333": 205,
  ".5000": 206,
  ".500000000000": 207,
  ".556": 208,
  ".66666667": 209,
  ".000000000000000": 210,
  ".009": 211,
  ".011": 212,
  ".015": 213,
  ".101": 214,
  ".124": 215,
  ".141592": 216,
  ".1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679": 217,
  ".236": 218,
  ".3333": 219,
  ".5000000000": 220,
  ".71828": 221,
  ".7182818284590452354": 222,
  ".99999": 223,
  ".00000000000000": 224,
  ".0000000001": 225,
  ".022": 226,
  ".032": 227,
  ".042": 228,
  ".1000": 229,
  ".141592653": 230,
  ".1415926535897": 231,
  ".14159265358979323846264338327950": 232,
  ".141592654": 233,
  ".200": 234,
  ".400000": 235,
  ".70710678": 236,
  ".7677669529663684": 237,
  ".9999999": 238,
  ".9999999999999999": 239,
  ".00000000000000000000": 240,
  ".000003": 241,
  ".000005": 242,
  ".001002005": 243,
  ".008493": 244,
  ".032429402944324": 245,
  ".129": 246,
  ".1415926535897932": 247,
  ".141592653589793238460": 248,
  ".141592653589793238462643383279502884197169399": 249,
  ".1667": 250,
  ".1745": 251,
  ".197": 252,
  ".232": 253,
  ".456": 254,
  ".666666666667": 255,
  ".66667": 256,
  ".750": 257,
  ".8105": 258,
  ".867": 259,
  ".998997995": 260,
  ".000012": 261,
  ".0002": 262,
  ".0004": 263,
  ".018": 264,
  ".034": 265,
  ".071": 266,
  ".075": 267,
  ".102": 268,
  ".104": 269,
  ".111": 270,
  ".133": 271,
  ".14159265358": 272,
  ".14159265358979323846264338327950288": 273,
  ".141592653589793238462643383279502884": 274,
  ".142": 275,
  ".2030": 276,
  ".222": 277,
  ".225": 278,
  ".270": 279,
  ".28318530717958623200": 280,
  ".294823": 281,
  ".3456": 282,
  ".381966011": 283,
  ".3944760781": 284,
  ".4857454": 285,
  ".667": 286,
  ".866": 287,
  ".001003010": 288,
  ".014": 289,
  ".016666": 290,
  ".017": 291,
  ".080": 292,
  ".103": 293,
  ".107": 294,
  ".110": 295,
  ".123456789": 296,
  ".1415926535897932384626433832795028841971693993751": 297,
  ".14159265358979323846264338327950288419716939937510": 298,
  ".1415926535898": 299,
  ".16666666666666666": 300,
  ".181": 301,
  ".193": 302,
  ".196": 303,
  ".2020": 304,
  ".250000": 305,
  ".2761423749": 306,
  ".2958": 307,
  ".326": 308,
  ".33333333333": 309,
  ".345": 310,
  ".4142135623730951": 311,
  ".444": 312,
  ".472": 313,
  ".475": 314,
  ".5000000": 315,
  ".5103890714435813": 316,
  ".52680851947264": 317,
  ".535": 318,
  ".551": 319,
  ".555": 320,
  ".5589": 321,
  ".560": 322,
  ".567": 323,
  ".618033989": 324,
  ".656": 325,
  ".6634": 326,
  ".6666": 327,
  ".666666667": 328,
  ".7179869184": 329,
  ".789": 330,
  ".851": 331,
  ".9095993973784108": 332,
  ".998996990": 333,
  ".99999999": 334,
  ".00005": 335,
  ".008": 336,
  ".016": 337,
  ".024414": 338,
  ".035": 339,
  ".0625": 340,
  ".076": 341,
  ".0827625303": 342,
  ".088": 343,
  ".0999": 344,
  ".1016": 345,
  ".106": 346,
  ".1138": 347,
  ".117": 348,
  ".134": 349,
  ".135": 350,
  ".141592653589763": 351,
  ".141592653589793238462643383279": 352,
  ".144014": 353,
  ".148": 354,
  ".150": 355,
  ".1547": 356,
  ".16227766": 357,
  ".166667": 358,
  ".167": 359,
  ".1808": 360,
  ".1875": 361,
  ".1895": 362,
  ".192": 363,
  ".205": 364,
  ".209": 365,
  ".211": 366,
  ".212": 367,
  ".2145": 368,
  ".21758201684107934811445538123": 369,
  ".228": 370,
  ".229": 371,
  ".256": 372,
  ".26537": 373,
  ".283": 374,
  ".304": 375,
  ".306": 376,
  ".311": 377,
  ".321": 378,
  ".321336469": 379,
  ".3333333333333335": 380,
  ".333333333333336": 381,
  ".335": 382,
  ".3424": 383,
  ".414213": 384,
  ".432": 385,
  ".450": 386,
  ".452": 387,
  ".453": 388,
  ".454": 389,
  ".4946": 390,
  ".495": 391,
  ".4999": 392,
  ".500000000": 393,
  ".501": 394,
  ".508": 395,
  ".533": 396,
  ".536": 397,
  ".5384106": 398,
  ".5544": 399,
  ".56637": 400,
  ".570": 401,
  ".592": 402,
  ".600": 403,
  ".61803": 404,
  ".63243547": 405,
  ".654894264568898": 406,
  ".6651914291880924": 407,
  ".666": 408,
  ".666666": 409,
  ".6666666666666666": 410,
  ".684341886080802": 411,
  ".7071067812": 412,
  ".718": 413,
  ".718281828": 414,
  ".749": 415,
  ".755": 416,
  ".785": 417,
  ".85377021": 418,
  ".857142857142857": 419,
  ".87441459": 420,
  ".914213562373095": 421,
  ".927": 422,
  ".931851653": 423,
  ".9375": 424,
  ".944": 425,
  ".982702": 426,
  ".987": 427,
  ".0000000000001": 428,
  ".000000005": 429,
  ".000000505915881586767": 430,
  ".00003865": 431,
  ".0007": 432,
  ".0010": 433,
  ".0012": 434,
  ".013": 435,
  ".0165315982205586": 436,
  ".019": 437,
  ".023": 438,
  ".026": 439,
  ".031": 440,
  ".040": 441,
  ".045": 442,
  ".047": 443,
  ".051": 444,
  ".0523474780988326": 445,
  ".056": 446,
  ".057": 447,
  ".06091743": 448,
  ".081": 449,
  ".086": 450,
  ".097": 451,
  ".10000": 452,
  ".10000000": 453,
  ".10517": 454,
  ".108": 455,
  ".114526": 456,
  ".115": 457,
  ".116": 458,
  ".118033988": 459,
  ".125000": 460,
  ".131": 461,
  ".136": 462,
  ".137": 463,
  ".141": 464,
  ".14159265358979323": 465,
  ".14159265358979323846264": 466,
  ".1415926535897932384626433": 467,
  ".14159265358979323846264338": 468,
  ".14159265358979323846264338327950288419716939937510582097494459230781640628620899": 469,
  ".14159265358979323851280895940618620443274267017841": 470,
  ".1415927": 471,
  ".144084": 472,
  ".145833333333": 473,
  ".147": 474,
  ".152": 475,
  ".156": 476,
  ".162": 477,
  ".1622776601683795": 478,
  ".165": 479,
  ".166": 480,
  ".174": 481,
  ".176": 482,
  ".189": 483,
  ".196226611": 484,
  ".200000": 485,
  ".2002": 486,
  ".201": 487,
  ".202": 488,
  ".202792643222829": 489,
  ".213": 490,
  ".215": 491,
  ".219": 492,
  ".223": 493,
  ".224": 494,
  ".22491": 495,
  ".226": 496,
  ".2345": 497,
  ".23606797749979": 498,
  ".25000": 499,
  ".252": 500,
  ".253": 501,
  ".281": 502,
  ".28318": 503,
  ".286": 504,
  ".288": 505,
  ".295": 506,
  ".313": 507,
  ".325": 508,
  ".32806186242": 509,
  ".3333333": 510,
  ".333333333": 511,
  ".333333333333": 512,
  ".342": 513,
  ".353": 514,
  ".399": 515,
  ".414213562": 516,
  ".41421356237": 517,
  ".4142135670343": 518,
  ".4159265352718281828459045": 519,
  ".434": 520,
  ".447": 521,
  ".462": 522,
  ".466": 523,
  ".4999999": 524,
  ".5000001": 525,
  ".507": 526,
  ".510": 527,
  ".513": 528,
  ".531": 529,
  ".545": 530,
  ".54617859282262744497": 531,
  ".550": 532,
  ".5625": 533,
  ".563": 534,
  ".572": 535,
  ".575": 536,
  ".581": 537,
  ".5825436059": 538,
  ".58413": 539,
  ".597988": 540,
  ".627": 541,
  ".6466": 542,
  ".6666666": 543,
  ".66666666": 544,
  ".666666666": 545,
  ".666666666666667": 546,
  ".6666666667": 547,
  ".677": 548,
  ".702": 549,
  ".70387": 550,
  ".7182818284": 551,
  ".718281828459": 552,
  ".7182818284590452353602874713527": 553,
  ".718281828459045235428168107993940338928950950503355": 554,
  ".732": 555,
  ".73205": 556,
  ".733": 557,
  ".7401153702": 558,
  ".745": 559,
  ".756": 560,
  ".77778": 561,
  ".800000": 562,
  ".810": 563,
  ".818181818182": 564,
  ".870": 565,
  ".871": 566,
  ".886": 567,
  ".887": 568,
  ".890": 569,
  ".898": 570,
  ".905": 571,
  ".908": 572,
  ".913": 573,
  ".938": 574,
  ".957": 575,
  ".965": 576,
  ".966": 577,
  ".99996906663389": 578,
  ".99999999999999": 579,
  ".999999999999999": 580,
  ".000000000000000000000000000000000000000000000000": 581,
  ".0000000000000000000000000000000000000000000000000001": 582,
  ".0000000000000000001": 583,
  ".00000000000000005": 584,
  ".0000000000000001": 585,
  ".000000000000004": 586,
  ".0000000005": 587,
  ".00000010": 588,
  ".000000999": 589,
  ".000002": 590,
  ".000007": 591,
  ".000021": 592,
  ".00011": 593,
  ".00011221": 594,
  ".00012": 595,
  ".00017602": 596,
  ".0002395": 597,
  ".0002480000000002": 598,
  ".0003": 599,
  ".00059303": 600,
  ".00067803821": 601,
  ".000908": 602,
  ".00096049": 603,
  ".00111": 604,
  ".00112036": 605,
  ".001553": 606,
  ".0015909577207": 607,
  ".001618": 608,
  ".001981759": 609,
  ".0020083928260822144": 610,
  ".00206": 611,
  ".0022": 612,
  ".0047289452246": 613,
  ".0078125": 614,
  ".0083492773819228268": 615,
  ".01000": 616,
  ".0109595998242122": 617,
  ".0143": 618,
  ".014928699": 619,
  ".0155": 620,
  ".0173430619844491397": 621,
  ".01745": 622,
  ".0175": 623,
  ".020625": 624,
  ".0212": 625,
  ".02551153690328": 626,
  ".02690720000096": 627,
  ".027": 628,
  ".028": 629,
  ".02978190000": 630,
  ".030": 631,
  ".030490": 632,
  ".03363453511703": 633,
  ".0369277551433699263": 634,
  ".037": 635,
  ".0375": 636,
  ".039": 637,
  ".041667": 638,
  ".044": 639,
  ".04657": 640,
  ".048": 641,
  ".049": 642,
  ".050858562089003": 643,
  ".051128": 644,
  ".053": 645,
  ".05317021": 646,
  ".055": 647,
  ".0555": 648,
  ".059": 649,
  ".060": 650,
  ".061": 651,
  ".062": 652,
  ".06250": 653,
  ".063": 654,
  ".067": 655,
  ".069": 656,
  ".072": 657,
  ".073": 658,
  ".07441645": 659,
  ".078": 660,
  ".079": 661,
  ".083": 662,
  ".0844639": 663,
  ".0858": 664,
  ".087": 665,
  ".093": 666,
  ".094": 667,
  ".0952": 668,
  ".096": 669,
  ".0965091": 670,
  ".097905": 671,
  ".09845": 672,
  ".099": 673,
  ".09904833691639": 674,
  ".10000000000000002": 675,
  ".1001": 676,
  ".1007": 677,
  ".1046": 678,
  ".105": 679,
  ".109": 680,
  ".11111": 681,
  ".11803398875": 682,
  ".121": 683,
  ".122": 684,
  ".12248952": 685,
  ".1227": 686,
  ".1234": 687,
  ".123456789101112131415161718192021": 688,
  ".124459548634": 689,
  ".130": 690,
  ".1307": 691,
  ".1311332520": 692,
  ".1319174504": 693,
  ".132": 694,
  ".13735864262480002": 695,
  ".138": 696,
  ".140": 697,
  ".1415926535897931": 698,
  ".1415926535897932384": 699,
  ".141592653589793238462643383": 700,
  ".1415926535897932384626433832792884197169399375105820974944": 701,
  ".141592653589793238462643383279502884197": 702,
  ".141592653589793238462643383279502884197169399375105820974944592307816406286208998628034825": 703,
  ".1415926535897932384626433832795146484375": 704,
  ".14159265358979323846265": 705,
  ".1415926535897932385": 706,
  ".141592653590": 707,
  ".141593": 708,
  ".142857": 709,
  ".1458333333": 710,
  ".149": 711,
  ".153": 712,
  ".1541": 713,
  ".155": 714,
  ".15802250481605053": 715,
  ".161": 716,
  ".1622776602": 717,
  ".1665": 718,
  ".1666": 719,
  ".172": 720,
  ".180": 721,
  ".1811": 722,
  ".18141": 723,
  ".182": 724,
  ".182117721156": 725,
  ".184": 726,
  ".1861": 727,
  ".187": 728,
  ".18700000": 729,
  ".1900989056644": 730,
  ".19824": 731,
  ".1999999999999999": 732,
  ".2000": 733,
  ".2000000000": 734,
  ".2019": 735,
  ".2021": 736,
  ".2023": 737,
  ".202792643100437": 738,
  ".204": 739,
  ".204349": 740,
  ".207107": 741,
  ".210": 742,
  ".21345172": 743,
  ".214": 744,
  ".217": 745,
  ".2222": 746,
  ".223372": 747,
  ".230": 748,
  ".235987755982989": 749,
  ".236067977": 750,
  ".2360679775": 751,
  ".23606798": 752,
  ".238": 753,
  ".240": 754,
  ".244": 755,
  ".2469152712004105975": 756,
  ".248": 757,
  ".249": 758,
  ".251327413": 759,
  ".2544726128793": 760,
  ".264": 761,
  ".265": 762,
  ".26530612244897955": 763,
  ".267": 764,
  ".271": 765,
  ".2715769259741": 766,
  ".274": 767,
  ".2777986890249427": 768,
  ".278": 769,
  ".282": 770,
  ".28205304001084": 771,
  ".285": 772,
  ".2957931": 773,
  ".296": 774,
  ".299": 775,
  ".300": 776,
  ".30000": 777,
  ".303": 778,
  ".307": 779,
  ".307692307692307": 780,
  ".3081": 781,
  ".309215063299132": 782,
  ".3146031008": 783,
  ".3152087299213999": 784,
  ".320": 785,
  ".323": 786,
  ".324426739240936436": 787,
  ".32653061224489794": 788,
  ".327": 789,
  ".3333333333": 790,
  ".3333333333333": 791,
  ".3378": 792,
  ".338": 793,
  ".343": 794,
  ".34326": 795,
  ".344": 796,
  ".3455722122632916": 797,
  ".34621": 798,
  ".347": 799,
  ".3493337640954775": 800,
  ".353509": 801,
  ".355": 802,
  ".363": 803,
  ".3660": 804,
  ".36792493793929979": 805,
  ".37237": 806,
  ".374": 807,
  ".376835053512": 808,
  ".37710899982856": 809,
  ".3819661": 810,
  ".382": 811,
  ".38262237": 812,
  ".3842": 813,
  ".385": 814,
  ".390": 815,
  ".3922": 816,
  ".395": 817,
  ".40000000": 818,
  ".4031242374328": 819,
  ".408": 820,
  ".411": 821,
  ".41421356": 822,
  ".4142135623": 823,
  ".4142136": 824,
  ".4167": 825,
  ".419": 826,
  ".42857143": 827,
  ".42866687328467": 828,
  ".4293": 829,
  ".43056851": 830,
  ".43301270189221932": 831,
  ".4365": 832,
  ".438": 833,
  ".44083913": 834,
  ".442": 835,
  ".44444": 836,
  ".44444444": 837,
  ".451": 838,
  ".458": 839,
  ".468": 840,
  ".46989014": 841,
  ".4777": 842,
  ".478": 843,
  ".479": 844,
  ".483": 845,
  ".48528137423857": 846,
  ".487": 847,
  ".493": 848,
  ".493033033270104": 849,
  ".499": 850,
  ".499750": 851,
  ".49999": 852,
  ".499999999999999": 853,
  ".50000000": 854,
  ".5000000000000001": 855,
  ".500001": 856,
  ".502": 857,
  ".505": 858,
  ".506": 859,
  ".509": 860,
  ".509226258967219": 861,
  ".5123": 862,
  ".517803": 863,
  ".5200": 864,
  ".524": 865,
  ".525": 866,
  ".529411764705883": 867,
  ".533333": 868,
  ".537": 869,
  ".53975": 870,
  ".53981633974483": 871,
  ".54000000000001": 872,
  ".542": 873,
  ".544": 874,
  ".5442": 875,
  ".546": 876,
  ".546168065709": 877,
  ".547": 878,
  ".548": 879,
  ".55360000": 880,
  ".55555": 881,
  ".558": 882,
  ".55811098": 883,
  ".559": 884,
  ".565": 885,
  ".56636": 886,
  ".566667": 887,
  ".569": 888,
  ".571428571428573": 889,
  ".580": 890,
  ".58113883": 891,
  ".582": 892,
  ".589": 893,
  ".590": 894,
  ".593": 895,
  ".594": 896,
  ".6006": 897,
  ".6007300000000134": 898,
  ".605": 899,
  ".608": 900,
  ".610": 901,
  ".611": 902,
  ".6180339": 903,
  ".618033988": 904,
  ".618033988749895": 905,
  ".628": 906,
  ".635": 907,
  ".638023": 908,
  ".6403124237432": 909,
  ".642": 910,
  ".6427876097": 911,
  ".644": 912,
  ".6457513110645907": 913,
  ".647": 914,
  ".648584689": 915,
  ".650281539872885": 916,
  ".651": 917,
  ".65464": 918,
  ".666666666666666": 919,
  ".666666666666668": 920,
  ".66918616": 921,
  ".671": 922,
  ".675": 923,
  ".680": 924,
  ".681": 925,
  ".683281573000": 926,
  ".68695126": 927,
  ".687663595": 928,
  ".688": 929,
  ".692": 930,
  ".695": 931,
  ".70000": 932,
  ".703": 933,
  ".707": 934,
  ".7071": 935,
  ".708203932499369": 936,
  ".709": 937,
  ".718281828459045": 938,
  ".71828182846": 939,
  ".724": 940,
  ".72787575679752": 941,
  ".7320508075688772": 942,
  ".73205080757": 943,
  ".7320508076": 944,
  ".7335": 945,
  ".735": 946,
  ".736": 947,
  ".7371070363010862": 948,
  ".741": 949,
  ".742": 950,
  ".74880": 951,
  ".752": 952,
  ".7555153710421": 953,
  ".7566381405488065": 954,
  ".763559435749": 955,
  ".76631543": 956,
  ".76636859": 957,
  ".767": 958,
  ".777": 959,
  ".7778": 960,
  ".779": 961,
  ".78333": 962,
  ".7963569": 963,
  ".79648": 964,
  ".797": 965,
  ".7976931348623157": 966,
  ".800": 967,
  ".804": 968,
  ".806": 969,
  ".8110761": 970,
  ".81118952": 971,
  ".812": 972,
  ".81481481": 973,
  ".81649658": 974,
  ".8170": 975,
  ".818": 976,
  ".82248952": 977,
  ".82842": 978,
  ".8284271": 979,
  ".8284271247461903": 980,
  ".828427125": 981,
  ".833": 982,
  ".8333": 983,
  ".8333333333333333": 984,
  ".8333333333333334": 985,
  ".839": 986,
  ".8430": 987,
  ".8432": 988,
  ".843302875072616681": 989,
  ".846": 990,
  ".85677655": 991,
  ".8584": 992,
  ".872": 993,
  ".874": 994,
  ".87643341399": 995,
  ".878": 996,
  ".890052356020942": 997,
  ".89612672": 998,
  ".89975": 999,
  ".899996": 1000,
  ".900": 1001,
  ".904": 1002,
  ".923197": 1003,
  ".9287445248": 1004,
  ".929": 1005,
  ".92923867733065": 1006,
  ".9411764705882353": 1007,
  ".95274111": 1008,
  ".95294117": 1009,
  ".95399": 1010,
  ".954": 1011,
  ".95775": 1012,
  ".96078431": 1013,
  ".966237": 1014,
  ".9669": 1015,
  ".973": 1016,
  ".978455": 1017,
  ".982": 1018,
  ".983": 1019,
  ".984375": 1020,
  ".984750918810807801": 1021,
  ".985071301": 1022,
  ".988": 1023,
  ".9898": 1024,
  ".98989899": 1025,
  ".9900000": 1026,
  ".991": 1027,
  ".992": 1028,
  ".9927": 1029,
  ".995": 1030,
  ".997999999": 1031,
  ".998999999": 1032,
  ".99903": 1033,
  ".99998": 1034,
  ".99998444": 1035,
  ".999995": 1036,
  ".9999999999": 1037,
  ".999999999997": 1038
}